In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 2, np.nan])

In [3]:
s

0    1.0
1    2.0
2    NaN
dtype: float64

In [4]:
s[0]

1.0

In [5]:
s.sum()

3.0

In [6]:
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df

   A  B
0  1  3
1  2  4

In [7]:
df.dtypes

A    int64
B    int64
dtype: object

In [8]:
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0  0.707851 -1.265166 -0.176627 -1.181244
1 -0.304401  0.346507 -0.774046  0.254324
2  1.010036  0.768911  0.288137  1.036798
3  0.349545  1.235995 -1.596801  0.480238
4 -1.019047  0.694655  1.432257 -0.653820
5 -0.404796 -0.316594 -0.216684 -0.348760

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20170101', periods=6))

In [10]:
df

                   0         1         2         3
2017-01-01  1.442521 -0.003620 -0.152279  0.813308
2017-01-02 -0.312339 -0.108449 -0.143030 -1.062787
2017-01-03 -1.820079 -0.880968  0.386711 -0.102116
2017-01-04 -0.010578  0.283193 -0.816192 -0.910365
2017-01-05 -0.247094  0.434771  0.450498  0.072534
2017-01-06  1.282045  0.248942  1.609021  0.551924

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20170101', periods=6), columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2017-01-01  0.068399 -1.588838  0.467310  0.118097
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970
2017-01-06  1.316049  0.910183  0.038003  1.464537

In [12]:
df.head(1)

                   A         B        C         D
2017-01-01  0.068399 -1.588838  0.46731  0.118097

In [13]:
df.tail(3)

                   A         B         C         D
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970
2017-01-06  1.316049  0.910183  0.038003  1.464537

In [14]:
df.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[ 0.06839853, -1.58883798,  0.4673103 ,  0.11809657],
       [ 0.83595587,  1.67885886,  0.66846431,  0.17266079],
       [ 0.81975375, -2.10191169, -0.36920767, -1.23798629],
       [-0.64116464, -0.99315307, -0.54806443, -1.59318902],
       [-1.35727315,  0.15830239, -1.52953121, -0.69497007],
       [ 1.31604858,  0.91018282,  0.038003  ,  1.46453666]])

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.173620 -0.322760 -0.212171 -0.295142
std    1.017831  1.481608  0.796583  1.115331
min   -1.357273 -2.101912 -1.529531 -1.593189
25%   -0.463774 -1.439917 -0.503350 -1.102232
50%    0.444076 -0.417425 -0.165602 -0.288437
75%    0.831905  0.722213  0.359983  0.159020
max    1.316049  1.678859  0.668464  1.464537

In [18]:
df.T

   2017-01-01  2017-01-02  2017-01-03  2017-01-04  2017-01-05  2017-01-06
A    0.068399    0.835956    0.819754   -0.641165   -1.357273    1.316049
B   -1.588838    1.678859   -2.101912   -0.993153    0.158302    0.910183
C    0.467310    0.668464   -0.369208   -0.548064   -1.529531    0.038003
D    0.118097    0.172661   -1.237986   -1.593189   -0.694970    1.464537

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986
2017-01-01  0.068399 -1.588838  0.467310  0.118097
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970
2017-01-06  1.316049  0.910183  0.038003  1.464537
2017-01-02  0.835956  1.678859  0.668464  0.172661

In [20]:
df[0:3]

                   A         B         C         D
2017-01-01  0.068399 -1.588838  0.467310  0.118097
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986

In [21]:
df['20170102':'20170104']

                   A         B         C         D
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189

In [22]:
df.loc['20170101']

A    0.068399
B   -1.588838
C    0.467310
D    0.118097
Name: 2017-01-01 00:00:00, dtype: float64

In [23]:
df.loc['20170102', ['A', 'B']]

A    0.835956
B    1.678859
Name: 2017-01-02 00:00:00, dtype: float64

In [24]:
df.loc['20170102':'20170104', ['A', 'B']]

                   A         B
2017-01-02  0.835956  1.678859
2017-01-03  0.819754 -2.101912
2017-01-04 -0.641165 -0.993153

In [25]:
df.loc[:, ['A', 'B']]

                   A         B
2017-01-01  0.068399 -1.588838
2017-01-02  0.835956  1.678859
2017-01-03  0.819754 -2.101912
2017-01-04 -0.641165 -0.993153
2017-01-05 -1.357273  0.158302
2017-01-06  1.316049  0.910183

In [26]:
df.iloc[0, 0]

0.068398528095235347

In [27]:
df.iloc[0:2, 0:2]

                   A         B
2017-01-01  0.068399 -1.588838
2017-01-02  0.835956  1.678859

In [28]:
df[df.B > 0]

                   A         B         C         D
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970
2017-01-06  1.316049  0.910183  0.038003  1.464537

In [29]:
df[df > 0]

                   A         B         C         D
2017-01-01  0.068399       NaN  0.467310  0.118097
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-03  0.819754       NaN       NaN       NaN
2017-01-04       NaN       NaN       NaN       NaN
2017-01-05       NaN  0.158302       NaN       NaN
2017-01-06  1.316049  0.910183  0.038003  1.464537

In [30]:
df

                   A         B         C         D
2017-01-01  0.068399 -1.588838  0.467310  0.118097
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970
2017-01-06  1.316049  0.910183  0.038003  1.464537

In [31]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'tow', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2017-01-01  0.068399 -1.588838  0.467310  0.118097    one
2017-01-02  0.835956  1.678859  0.668464  0.172661    one
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986    tow
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189  three
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970   four
2017-01-06  1.316049  0.910183  0.038003  1.464537  three

In [32]:
df2[df2['E'].isin(['one', 'four'])]

                   A         B         C         D     E
2017-01-01  0.068399 -1.588838  0.467310  0.118097   one
2017-01-02  0.835956  1.678859  0.668464  0.172661   one
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970  four

In [33]:
df

                   A         B         C         D
2017-01-01  0.068399 -1.588838  0.467310  0.118097
2017-01-02  0.835956  1.678859  0.668464  0.172661
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970
2017-01-06  1.316049  0.910183  0.038003  1.464537

In [34]:
s = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20170101', periods=6))

In [35]:
s

2017-01-01    1
2017-01-02    2
2017-01-03    3
2017-01-04    4
2017-01-05    5
2017-01-06    6
Freq: D, dtype: int64

In [36]:
df['E'] = s

In [37]:
df

                   A         B         C         D  E
2017-01-01  0.068399 -1.588838  0.467310  0.118097  1
2017-01-02  0.835956  1.678859  0.668464  0.172661  2
2017-01-03  0.819754 -2.101912 -0.369208 -1.237986  3
2017-01-04 -0.641165 -0.993153 -0.548064 -1.593189  4
2017-01-05 -1.357273  0.158302 -1.529531 -0.694970  5
2017-01-06  1.316049  0.910183  0.038003  1.464537  6

In [38]:
df.shift(1)

                   A         B         C         D    E
2017-01-01       NaN       NaN       NaN       NaN  NaN
2017-01-02  0.068399 -1.588838  0.467310  0.118097  1.0
2017-01-03  0.835956  1.678859  0.668464  0.172661  2.0
2017-01-04  0.819754 -2.101912 -0.369208 -1.237986  3.0
2017-01-05 -0.641165 -0.993153 -0.548064 -1.593189  4.0
2017-01-06 -1.357273  0.158302 -1.529531 -0.694970  5.0

In [40]:
df = pd.DataFrame(np.random.randn(2, 2))

In [41]:
df

          0         1
0 -0.171598  0.243335
1 -1.426522  0.338376

In [42]:
pd.concat([df, df])

          0         1
0 -0.171598  0.243335
1 -1.426522  0.338376
0 -0.171598  0.243335
1 -1.426522  0.338376

In [45]:
df = pd.DataFrame(np.random.rand(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.181837  0.392915  0.736987  0.213959
1  0.939520  0.602958  0.223617  0.501659
2  0.774211  0.303183  0.390241  0.083419
3  0.162485  0.796816  0.076749  0.732744
4  0.527041  0.005396  0.558870  0.762071
5  0.524757  0.976119  0.008898  0.968897
6  0.947116  0.363175  0.838763  0.621987
7  0.400547  0.164585  0.139889  0.534002

In [46]:
s = df.iloc[0]
s

A    0.181837
B    0.392915
C    0.736987
D    0.213959
Name: 0, dtype: float64

In [47]:
df.append(s)

          A         B         C         D
0  0.181837  0.392915  0.736987  0.213959
1  0.939520  0.602958  0.223617  0.501659
2  0.774211  0.303183  0.390241  0.083419
3  0.162485  0.796816  0.076749  0.732744
4  0.527041  0.005396  0.558870  0.762071
5  0.524757  0.976119  0.008898  0.968897
6  0.947116  0.363175  0.838763  0.621987
7  0.400547  0.164585  0.139889  0.534002
0  0.181837  0.392915  0.736987  0.213959

In [48]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.181837  0.392915  0.736987  0.213959
1  0.939520  0.602958  0.223617  0.501659
2  0.774211  0.303183  0.390241  0.083419
3  0.162485  0.796816  0.076749  0.732744
4  0.527041  0.005396  0.558870  0.762071
5  0.524757  0.976119  0.008898  0.968897
6  0.947116  0.363175  0.838763  0.621987
7  0.400547  0.164585  0.139889  0.534002
8  0.181837  0.392915  0.736987  0.213959

In [49]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar'], 'B': np.random.randn(4)})

In [50]:
df

     A         B
0  foo -0.682975
1  bar -0.308696
2  foo  0.383483
3  bar -0.641773

In [51]:
df.groupby('A').sum()

            B
A
bar -0.950469
foo -0.299492

In [52]:
# pip install pandas_datareader

In [53]:
import pandas_datareader

In [54]:
df = pandas_datareader.data.DataReader('AAPL', 'yahoo', '2014-01-01')

In [56]:
df.head(1)

                 Open       High        Low     Close  Adj Close    Volume
Date
2014-01-02  79.382858  79.575714  78.860001  79.01857  73.259171  58671200